---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementType
source: html/8757156f-79ec-fdff-e74d-7c86e576b73e.htm
---
# ElementType Properties

The id of the assembly instance to which the element belongs.